FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_adc.c
  /* Clear ADCPRE bit */ 
  tmpreg &= CR_CLEAR_MASK;
  
  /* Configure ADCx: ADC prescaler according to ADC_Prescaler */                
  tmpreg |= (uint32_t)(ADC_CommonInitStruct->ADC_Prescaler);        
                
  /* Write to ADC CCR */
  ADC->CCR = tmpreg;
}

/**
  * @brief  Fills each ADC_CommonInitStruct member with its default value.
  * @param  ADC_CommonInitStruct: pointer to an ADC_CommonInitTypeDef structure
  *         which will be initialized.
  * @retval None
  */
void ADC_CommonStructInit(ADC_CommonInitTypeDef* ADC_CommonInitStruct)                      
{
  /* Reset ADC init structure parameters values */
  /* Initialize the ADC_Prescaler member */
  ADC_CommonInitStruct->ADC_Prescaler = ADC_Prescaler_Div1;
}

/**
  * @brief  Enables or disables the specified ADC peripheral.
  * @param  ADCx: where x can be 1 to select the ADC1 peripheral.
  * @param  NewState: new state of the ADCx peripheral.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC_Cmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the ADON bit to wake up the ADC from power down mode */
    ADCx->CR2 |= (uint32_t)ADC_CR2_ADON;
  }
  else
  {
    /* Disable the selected ADC peripheral */
    ADCx->CR2 &= (uint32_t)(~ADC_CR2_ADON);
  }
}

/**
  * @brief  Selects the specified ADC Channels Bank.
  * @param  ADCx: where x can be 1 to select the ADC1 peripheral.
  * @param  ADC_Bank: ADC Channels Bank.
  *     @arg ADC_Bank_A: ADC Channels Bank A.
  *     @arg ADC_Bank_B: ADC Channels Bank B.
  * @retval None
  */
void ADC_BankSelection(ADC_TypeDef* ADCx, uint8_t ADC_Bank)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_BANK(ADC_Bank));

  if (ADC_Bank != ADC_Bank_A)
  {
    /* Set the ADC_CFG bit to select the ADC Bank B channels */
    ADCx->CR2 |= (uint32_t)ADC_CR2_CFG;
  }
  else
  {
    /* Reset the ADC_CFG bit to select the ADC Bank A channels */
    ADCx->CR2 &= (uint32_t)(~ADC_CR2_CFG);
  }
}

/**
  * @}
  */

/** @defgroup ADC_Group2 Power saving functions
 *  @brief   Power saving functions 
 *
@verbatim   
 ===============================================================================
                    ##### Power saving functions #####
 ===============================================================================
    [..] This section provides functions allowing to reduce power consumption.
    [..] The two function must be combined to get the maximal benefits:
         When the ADC frequency is higher than the CPU one, it is recommended to:
         (#) Insert a freeze delay :
             ==> using ADC_DelaySelectionConfig(ADC1, ADC_DelayLength_Freeze).
         (#) Enable the power down in Idle and Delay phases :
             ==> using ADC_PowerDownCmd(ADC1, ADC_PowerDown_Idle_Delay, ENABLE).

@endverbatim
  * @{
  */

/**
  * @brief  Enables or disables the ADC Power Down during Delay and/or Idle phase.
  * @note   ADC power-on and power-off can be managed by hardware to cut the 
  *         consumption when the ADC is not converting.
  * @param  ADCx: where x can be 1 to select the ADC1 peripheral.
  * @param  ADC_PowerDown: The ADC power down configuration.
  *         This parameter can be one of the following values:
  *     @arg ADC_PowerDown_Delay:      ADC is powered down during delay phase.
  *     @arg ADC_PowerDown_Idle:       ADC is powered down during Idle phase.
  *     @arg ADC_PowerDown_Idle_Delay: ADC is powered down during Delay and Idle phases.
  * @note   The ADC can be powered down:
  * @note   During the hardware delay insertion (using the ADC_PowerDown_Delay
  *           parameter).
  *           => The ADC is powered up again at the end of the delay.
  * @note   During the ADC is waiting for a trigger event ( using the 
  *           ADC_PowerDown_Idle parameter).
  *           => The ADC is powered up at the next trigger event.
  * @note   During the hardware delay insertion or the ADC is waiting for a 
  *           trigger event (using the ADC_PowerDown_Idle_Delay parameter).
  *            => The ADC is powered up only at the end of the delay and at the
  *              next trigger event.
  * @param  NewState: new state of the ADCx power down.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC_PowerDownCmd(ADC_TypeDef* ADCx, uint32_t ADC_PowerDown, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  assert_param(IS_ADC_POWER_DOWN(ADC_PowerDown));
  
  if (NewState != DISABLE)
  {
    /* Enable the ADC power-down during Delay and/or Idle phase */
    ADCx->CR1 |= ADC_PowerDown;
  }
  else
  {
    /* Disable The ADC power-down during Delay and/or Idle phase */
    ADCx->CR1 &= (uint32_t)~ADC_PowerDown;
  }
}

/**
  * @brief  Defines the length of the delay which is applied after a conversion 
  *         or a sequence of conversion.
  * @note   When the CPU clock is not fast enough to manage the data rate, a 
  *         Hardware delay can be introduced between ADC conversions to reduce 
  *         this data rate.
  * @note   The Hardware delay is inserted after :
  *         - each regular conversion.
  *         - after each sequence of injected conversions.
  * @note   No Hardware delay is inserted between conversions of different groups.
  * @note   When the hardware delay is not enough, the Freeze Delay Mode can be 
  *         selected and a new conversion can start only if all the previous data 
  *         of the same group have been treated:
  *         - for a regular conversion: once the ADC conversion data register has 
  *           been read (using ADC_GetConversionValue() function) or if the EOC 
  *           Flag has been cleared (using ADC_ClearFlag() function).
  *         - for an injected conversion: when the JEOC bit has been cleared 
  *           (using ADC_ClearFlag() function).
  * @param  ADCx: where x can be 1 to select the ADC1 peripheral.
  * @param  ADC_DelayLength: The length of delay which is applied after a 
  *         conversion or a sequence of conversion. 
  *   This parameter can be one of the following values:
  *     @arg ADC_DelayLength_None: No delay.
  *     @arg ADC_DelayLength_Freeze: Delay until the converted data has been read.
  *     @arg ADC_DelayLength_7Cycles: Delay length equal to 7 APB clock cycles.
  *     @arg ADC_DelayLength_15Cycles: Delay length equal to 15 APB clock cycles	
  *     @arg ADC_DelayLength_31Cycles: Delay length equal to 31 APB clock cycles	
  *     @arg ADC_DelayLength_63Cycles: Delay length equal to 63 APB clock cycles	
  *     @arg ADC_DelayLength_127Cycles: Delay length equal to 127 APB clock cycles	
  *     @arg ADC_DelayLength_255Cycles: Delay length equal to 255 APB clock cycles	
  * @retval None
  */
void ADC_DelaySelectionConfig(ADC_TypeDef* ADCx, uint8_t ADC_DelayLength)
{
  uint32_t tmpreg = 0;
   
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_DELAY_LENGTH(ADC_DelayLength));

  /* Get the old register value */    
  tmpreg = ADCx->CR2;
  /* Clear the old delay length */
  tmpreg &= CR2_DELS_RESET;
  /* Set the delay length */
  tmpreg |= ADC_DelayLength;
  /* Store the new register value */
  ADCx->CR2 = tmpreg;

